%% 非线性函数-最小二乘法拟合    
% 已知一组自变量数据x和函数值y，以及函数形式y=f(c,x),但是表达式的参数c不知道。对数据xy进行拟合，求解参数c
% 基本格式 c=lsqcurvefit(fun,c0,x,y)
% 完整格式 [c,Q]=lsqcurvefit(fun,c0,x,y,lb,ub),c0为需要设置的迭代初值，x、y为已知数据(矩阵，x为多元则使用多维数组),lb、ub为参数c的上下限（可不写）。c0、x、y、lb、ub都是向量
% 返回拟合参数c,误差平方和Q

x = [49.4056,73.0212,92.4669,111.3024,126.151,140.3361,150.9838,161.0362,169.388]; %图像坐标系距离image_distance
y = [60,90,120,150,180,210,240,270,300]; %真实坐标系距离real_distance      
%fun = @(c,x)  c(1)*x.^2 + c(2)*exp(x)     % 示例函数表达式
fun = @(c,x)  c(1)*100*tan(c(2)*x)
[c,Q]=lsqcurvefit(fun,[2.00230000090,0.00580000090],x,y)     % (函数fun,参数初值[1,1],数据x,数据y)

